{
    "Install AIDE":"AIDE is not installed, leaving the system unable to detect unauthorized changes to critical files.",
    "Build and Test AIDE Database": "The AIDE database is missing or not initialized, making integrity checks unreliable.",
    "Configure AIDE to Verify the Audit Tools": "Audit-related binaries or configuration files are not included in AIDE's rules.",
    "Configure Periodic Execution of AIDE": "No cron job or timer exists to schedule AIDE scans.",
    "Package \"prelink\" Must not be Installed": "Prelink is installed, potentially corrupting AIDE’s or auditd's ability to detect unauthorized changes.",
    "Ensure /tmp Located On Separate Partition": "/tmp is part of the root partition, allowing applications to potentially consume all disk space or access sensitive areas.",
    "Disable the GNOME3 Login User List": "Login manager displays all local users, exposing user IDs to anyone with physical access.",
    "Disable XDMCP in GDM": "XDMCP is enabled, allowing remote graphical logins and increasing the risk of unauthorized access.",
    "Disable GNOME3 Automounting": "Automount is enabled, potentially allowing unauthorized or malicious USB devices to be automatically mounted.",
    "Disable GNOME3 Automount Opening": "Automount opening is enabled, allowing automatic file browser access to newly mounted media.",
    "Disable GNOME3 Automount running": "GNOME automount service is running, which can lead to unauthorized or unintended device mounts.",
    "Set GNOME3 Screensaver Lock Delay After Activation Period": "Screensaver lock delay is not configured, allowing physical access to an unattended session after screensaver starts.",
    "Enable GNOME3 Screensaver Lock After Idle Period": "Screen lock after idle is disabled, leaving unattended sessions unlocked.",
    "Configure GNOME3 DConf User Profile": "No DConf user profile is configured, preventing consistent enforcement of GNOME settings.",
    "Install sudo Package": "The sudo package is not installed, preventing controlled privilege escalation and command auditing.",
    "Ensure Only Users Logged In To Real tty Can Execute Sudo - sudo use_pty": "Sudo is not configured to use a pseudo-terminal, making it harder to log or monitor privileged command execution.",
    "Ensure Sudo Logfile Exists - sudo logfile": "No sudo logfile is defined, leading to a lack of audit trail for privileged operations.",
    "Ensure Users Re-Authenticate for Privilege Escalation - sudo !authenticate": "Sudo is configured to bypass password authentication, allowing users to elevate privileges without re-authenticating.",
    "Require Re-Authentication When Using the sudo Command": "Sudo does not require re-authentication, enabling privilege escalation without verifying the user’s identity again.",
    "Enable GNOME3 Login Warning Banner": "No login warning banner is enabled, missing legal notice and deterrence to unauthorized users.",
    "Set the GNOME3 Login Warning Banner Text": "GNOME login banner text is unset or empty, failing to provide a security notice or legal warning.",
    "Modify the System Login Banner": "/etc/issue is missing or empty, preventing display of a security warning at console login.",
    "Modify the System Login Banner for Remote Connections": "/etc/issue.net is missing or unconfigured, failing to warn remote users at SSH login.",
    "Modify the System Message of the Day Banner": "/etc/motd does not contain a security warning, missing an opportunity to notify users upon login.",
    "Verify Group Ownership of System Login Banner": "System login banner file group is not set to 'root', allowing unauthorized group access.",
    "Verify Group Ownership of System Login Banner for Remote Connections": "Remote login banner file group is incorrect, exposing it to unauthorized modifications.",
    "Verify Group Ownership of Message of the Day Banner": "MOTD banner group ownership is not 'root', risking unintended access or edits.",
    "Verify ownership of System Login Banner": "System login banner is not owned by root, allowing possible unauthorized changes.",
    "Verify ownership of System Login Banner for Remote Connections": "Remote login banner file is not root-owned, which could allow tampering.",
    "Verify ownership of Message of the Day Banner": "MOTD banner ownership is incorrect, compromising integrity of security notices.",
    "Verify permissions on System Login Banner": "Permissions on /etc/issue are too permissive, allowing unauthorized users to read or modify it.",
    "Verify permissions on System Login Banner for Remote Connections": "Permissions on /etc/issue.net are overly permissive, increasing the risk of tampering.",
    "Verify permissions on Message of the Day Banner": "MOTD file permissions allow unauthorized access or changes.",
    "Limit Password Reuse": "Password history is not enforced, allowing users to reuse old passwords and weakening password security.",
    "Lock Accounts After Failed Password Attempts": "Accounts are not locked after failed login attempts, allowing brute-force attacks.",
    "Set Interval For Counting Failed Password Attempts": "No time window is set for counting failed login attempts, making lockout policies ineffective.",
    "Set Lockout Time for Failed Password Attempts": "Lockout duration is not configured, allowing immediate retries after failed logins.",
    "Ensure PAM Enforces Password Requirements - Minimum Digit Characters": "No requirement for digits in passwords, allowing easily guessable passwords.",
    "Ensure PAM Enforces Password Requirements - Minimum Lowercase Characters": "Lowercase character requirement is missing, reducing password complexity.",
    "Ensure PAM Enforces Password Requirements - Minimum Different Categories": "No enforcement of varied character classes in passwords, weakening resistance to guessing.",
    "Ensure PAM Enforces Password Requirements - Minimum Length": "Password minimum length is too short, increasing the risk of brute-force attacks.",
    "Ensure PAM Enforces Password Requirements - Minimum Special Characters": "Special character requirement is not enforced, decreasing password strength.",
    "Ensure PAM Enforces Password Requirements - Authentication Retry Prompts Permitted Per-Session": "Unlimited retry prompts are allowed, enabling brute-force attempts.",
    "Ensure PAM Enforces Password Requirements - Minimum Uppercase Characters": "Uppercase character requirement is missing, reducing password complexity.",
    "Set Password Hashing Algorithm in /etc/login.defs": "Weak or default password hashing algorithm is used, exposing password hashes to cracking.",
    "Install pam_pwquality Package": "The pam_pwquality package is not installed, preventing enforcement of strong password rules.",
    "Set Account Expiration Following Inactivity": "Inactive accounts remain active indefinitely, risking account compromise.",
    "Ensure All Accounts on the System Have Unique Names": "Duplicate user names exist, which can lead to incorrect privilege assignment and audit trail confusion.",
    "Ensure shadow Group is Empty": "The shadow group contains users, allowing them to read sensitive password hashes.",
    "Set Password Maximum Age": "No maximum password age is set, allowing passwords to be used indefinitely.",
    "Set Password Minimum Age": "Minimum age is not configured, enabling users to change and reuse passwords immediately.",
    "Set Existing Passwords Maximum Age": "Some existing user accounts lack a maximum password age, reducing enforcement of periodic password changes.",
    "Set Existing Passwords Minimum Age": "Minimum password age is not set for some users, permitting frequent password changes to bypass reuse rules.",
    "Set Password Warning Age": "No warning age is set, preventing users from being notified before password expiration.",
    "Verify All Account Password Hashes are Shadowed": "Some password hashes are not stored in /etc/shadow, exposing them to unauthorized access.",
    "Ensure all users last password change date is in the past": "Some users have no recorded password change date, potentially indicating an unused or misconfigured account.",
    "All GIDs referenced in /etc/passwd must be defined in /etc/group": "User accounts reference undefined GIDs, which may cause permission inconsistencies.",
    "Ensure There Are No Accounts With Blank or Null Passwords": "Accounts with empty passwords exist, allowing unauthorized logins without credentials.",
    "Verify No .forward Files Exist": ".forward files exist, potentially allowing unauthorized email redirection.",
    "Verify No netrc Files Exist": ".netrc files are present, exposing stored credentials for automated logins.",
    "Verify Only Root Has UID 0": "Non-root accounts have UID 0, granting them unrestricted administrative privileges.",
    "Verify Root Has A Primary GID 0": "Root’s primary group is not GID 0, potentially causing improper group-level access control.",
    "Ensure the Group Used by pam_wheel.so Module Exists on System and is Empty": "The configured pam_wheel group does not exist or has unauthorized members, weakening su access control.",
    "Ensure Authentication Required for Single User Mode": "Single-user mode does not require authentication, allowing physical attackers to gain root access without credentials.",
    "Ensure that System Accounts Do Not Run a Shell Upon Login": "System accounts are assigned login shells, allowing them to be misused for interactive logins.",
    "Enforce Usage of pam_wheel with Group Parameter for su Authentication": "The pam_wheel module is not configured with a group restriction, allowing any user to switch to root with su.",
    "Ensure All Accounts on the System Have Unique User IDs": "Duplicate user IDs exist, which can lead to ambiguous ownership and accountability.",
    "Ensure All Groups on the System Have Unique Group ID": "Duplicate group IDs are present, creating permission conflicts and audit trail confusion.",
    "Ensure All Groups on the System Have Unique Group Names": "Group name duplication leads to inconsistent permissions and potential misconfigurations.",
    "Ensure that Root's Path Does Not Include World or Group-Writable Directories": "Root’s PATH includes writable directories, increasing risk of privilege escalation through malicious binaries.",
    "Ensure that Root's Path Does Not Include Relative Paths or Null Directories": "Relative or null paths in root’s PATH may cause unintended or malicious commands to execute.",
    "Ensure the Default Bash Umask is Set Correctly": "Bash umask is not set securely by default, resulting in overly permissive file permissions.",
    "Ensure the Default Umask is Set Correctly in login.defs": "login.defs umask is misconfigured, leading to insecure default permissions for user-created files.",
    "Ensure the Default Umask is Set Correctly in /etc/profile": "/etc/profile does not enforce a secure umask, allowing files to be created with excessive permissions.",
    "Ensure the Default Umask is Set Correctly For Interactive Users": "Interactive user sessions apply an insecure umask, risking unintended access to user files.",
    "Set Interactive Session Timeout": "No timeout is set for idle sessions, leaving systems vulnerable to unauthorized access.",
    "User Initialization Files Must Be Group-Owned By The Primary Group": "User init files are not group-owned by the user's primary group, risking improper group access.",
    "User Initialization Files Must Not Run World-Writable Programs": "User init scripts invoke world-writable executables, allowing tampering or privilege escalation.",
    "User Initialization Files Must Be Owned By the Primary User": "User init files are not owned by the user, enabling others to modify their login environment.",
    "All Interactive Users Home Directories Must Exist": "Some interactive users lack a home directory, breaking expected security and usability.",
    "All Interactive User Home Directories Must Be Group-Owned By The Primary Group": "Home directory group ownership is incorrect, risking improper access to personal files.",
    "All Interactive User Home Directories Must Be Owned By The Primary User": "Home directories are not owned by their users, allowing others to alter or access personal files.",
    "All Interactive User Home Directories Must Have mode 0750 Or Less Permissive": "Home directory permissions are too open, exposing user data to unauthorized access.",
    "Ensure AppArmor is installed": "AppArmor is not installed, leaving the system without mandatory access control enforcement.",
    "All AppArmor Profiles are in enforce or complain mode": "Some AppArmor profiles are disabled, allowing unconfined execution of processes.",
    "Ensure AppArmor is enabled in the bootloader configuration": "AppArmor is not enforced at boot, disabling protection before manual activation.",
    "Verify /boot/grub/grub.cfg User Ownership": "grub.cfg is not owned by root, allowing unauthorized users to modify bootloader settings.",
    "Verify /boot/grub/grub.cfg Permissions": "grub.cfg has insecure permissions, potentially allowing tampering with boot parameters.",
    "Set Boot Loader Password in grub2": "No password is set for the bootloader, allowing users to alter kernel boot options and bypass security.",
    "Set the UEFI Boot Loader Password": "UEFI boot password is not configured, allowing local users to modify firmware or boot configuration.",
    "Install systemd-journal-remote Package": "The systemd-journal-remote package is missing, preventing remote journal logging capabilities.",
    "Enable systemd-journald Service": "The journald service is disabled, preventing local logging of system events.",
    "Ensure journald is configured to compress large log files": "Journal logs are not compressed, leading to unnecessary disk usage.",
    "Ensure journald is configured to write log files to persistent disk": "journald is not writing to persistent storage, risking log loss after reboots.",
    "Disable systemd-journal-remote Socket": "The remote journal socket is enabled without intent to use it, exposing the system to unnecessary network services.",
    "Ensure rsyslog Does Not Accept Remote Messages Unless Acting As Log Server": "rsyslog is accepting remote logs without being configured as a log server, opening the system to spoofed log injection.",
    "Ensure Logs Sent To Remote Host": "System is not configured to forward logs to a remote host, risking loss of audit data during compromise.",
    "Ensure rsyslog is Installed": "rsyslog is not installed, eliminating a reliable system logging mechanism.",
    "Enable rsyslog Service": "The rsyslog service is not running, resulting in a loss of logging functionality.",
    "Ensure rsyslog Default File Permissions Configured": "rsyslog is configured to write logs with insecure permissions, risking unauthorized log access.",
    "Set Default ip6tables Policy for Incoming Packets": "Default IPv6 input policy is ACCEPT, allowing unsolicited incoming connections.",
    "Set configuration for IPv6 loopback traffic": "IPv6 loopback traffic is not explicitly allowed, possibly preventing local IPv6 communications.",
    "Set configuration for loopback traffic": "Loopback traffic rules are missing, which may block necessary local communications.",
    "Ensure ip6tables Firewall Rules Exist for All Open Ports": "No IPv6 firewall rules are defined for open ports, leaving services exposed to the network.",
    "Ensure iptables Firewall Rules Exist for All Open Ports": "Open ports lack iptables rules, potentially allowing unauthorized network access.",
    "Set Default iptables Policy for Incoming Packets": "Default iptables input policy is not DROP or REJECT, permitting unwanted traffic by default.",
    "Install iptables Package": "iptables is not installed, preventing local IPv4 firewall rule enforcement.",
    "Remove iptables-persistent Package": "iptables-persistent is installed, potentially allowing unintended automatic loading of legacy rules at boot.",
    "Configure Accepting Router Advertisements on All IPv6 Interfaces": "Router advertisements are improperly accepted, potentially enabling rogue RA attacks.",
    "Disable Accepting ICMP Redirects for All IPv6 Interfaces": "ICMP redirects are accepted, allowing route manipulation and man-in-the-middle attacks.",
    "Disable Kernel Parameter for Accepting Source-Routed Packets on all IPv6 Interfaces": "Source-routed packets are accepted, enabling attackers to bypass routing controls.",
    "Disable Kernel Parameter for IPv6 Forwarding": "IPv6 forwarding is enabled, allowing the system to route packets and potentially act as a router.",
    "Disable Accepting Router Advertisements on all IPv6 Interfaces by Default": "Router advertisements are accepted by default, exposing interfaces to malicious routing updates.",
    "Disable Kernel Parameter for Accepting ICMP Redirects by Default on IPv6 Interfaces": "ICMP redirect acceptance is enabled by default, risking route spoofing.",
    "Disable Kernel Parameter for Accepting Source-Routed Packets on IPv6 Interfaces by Default": "Source-routed packets are allowed by default, undermining secure routing.",
    "Disable Accepting ICMP Redirects for All IPv4 Interfaces": "ICMP redirects are accepted, allowing attackers to alter routing tables.",
    "Disable Kernel Parameter for Accepting Source-Routed Packets on all IPv4 Interfaces": "IPv4 source routing is enabled, which can be exploited to bypass network controls.",
    "Enable Kernel Parameter to Log Martian Packets on all IPv4 Interfaces": "Martian packets are not logged, reducing visibility into potentially spoofed traffic.",
    "Enable Kernel Parameter to Use Reverse Path Filtering on all IPv4 Interfaces": "Reverse path filtering is disabled, allowing IP spoofing attacks.",
    "Disable Kernel Parameter for Accepting Secure ICMP Redirects on all IPv4 Interfaces": "Secure ICMP redirects are accepted, which can still be exploited for route manipulation.",
    "Disable Kernel Parameter for Accepting ICMP Redirects by Default on IPv4 Interfaces": "ICMP redirect acceptance is enabled by default, increasing risk of routing attacks.",
    "Disable Kernel Parameter for Accepting Source-Routed Packets on IPv4 Interfaces by Default": "Source routing is allowed by default, enabling potential traffic redirection.",
    "Enable Kernel Paremeter to Log Martian Packets on all IPv4 Interfaces by Default": "Martian packets are not logged by default, limiting detection of invalid traffic.",
    "Enable Kernel Parameter to Use Reverse Path Filtering on all IPv4 Interfaces by Default": "Reverse path filtering is disabled by default, exposing the system to IP spoofing.",
    "Configure Kernel Parameter for Accepting Secure Redirects By Default": "Secure ICMP redirects are accepted by default, allowing route changes from trusted sources.",
    "Enable Kernel Parameter to Ignore ICMP Broadcast Echo Requests on IPv4 Interfaces": "ICMP broadcast echo requests are not ignored, allowing Smurf amplification attacks.",
    "Enable Kernel Parameter to Ignore Bogus ICMP Error Responses on IPv4 Interfaces": "Bogus ICMP responses are not ignored, increasing susceptibility to spoofed error messages.",
    "Enable Kernel Parameter to Use TCP Syncookies on Network Interfaces": "TCP SYN cookies are disabled, leaving the system vulnerable to SYN flood attacks.",
    "Disable Kernel Parameter for Sending ICMP Redirects on all IPv4 Interfaces": "ICMP redirects are sent, allowing the system to unintentionally assist in route manipulation.",
    "Disable Kernel Parameter for Sending ICMP Redirects on all IPv4 Interfaces by Default": "System sends ICMP redirects by default, which could guide other systems to insecure routes.",
    "Disable Kernel Parameter for IP Forwarding on IPv4 Interfaces": "IP forwarding is enabled, potentially allowing the host to unintentionally route traffic.",
    "Install nftables Package": "nftables is not installed, preventing use of the recommended modern firewall framework.",
    "Verify nftables Service is Enabled": "nftables service is not enabled, resulting in lack of firewall protection at boot.",
    "Ensure nftables Default Deny Firewall Policy": "nftables default policy is not deny, potentially allowing unwanted traffic.",
    "Ensure nftables Rules are Permanent": "Firewall rules are not configured to persist across reboots, weakening long-term protection.",
    "Ensure Base Chains Exist for Nftables": "Missing base chains in nftables may lead to incomplete traffic filtering.",
    "Set nftables Configuration for Loopback Traffic": "Loopback traffic rules are missing, which can disrupt local communications.",
    "Ensure a Table Exists for Nftables": "No nftables table is defined, leaving the firewall unconfigured.",
    "Remove ufw Package": "ufw is installed, which may conflict with the nftables firewall configuration.",
    "Verify ufw Enabled": "ufw is installed but not enabled, providing no active firewall protection.",
    "Ensure ufw Default Deny Firewall Policy": "ufw does not use a default deny policy, potentially exposing services.",
    "Set UFW Loopback Traffic": "ufw is not configured to allow loopback traffic, which may block internal processes.",
    "Ensure ufw Firewall Rules Exist for All Open Ports": "Open ports are not explicitly permitted by ufw, risking unintentional access or denial.",
    "Deactivate Wireless Network Interfaces": "Wireless interfaces are active, increasing exposure to rogue access points.",
    "Verify Group Who Owns Backup group File": "Backup group file is not group-owned by root, risking unauthorized group access.",
    "Verify Group Who Owns Backup gshadow File": "Backup gshadow file is not group-owned by root, compromising sensitive group password data.",
    "Verify Group Who Owns Backup passwd File": "Backup passwd file is not group-owned by root, allowing modification by unauthorized groups.",
    "Verify User Who Owns Backup shadow File": "Backup shadow file is not owned by root, risking unauthorized access to password hashes.",
    "Verify Group Who Owns group File": "group file is not group-owned by root, enabling privilege modifications by other groups.",
    "Verify Group Who Owns gshadow File": "gshadow file is not group-owned by root, potentially exposing group password data.",
    "Verify Group Who Owns passwd File": "passwd file is not group-owned by root, compromising integrity of user account info.",
    "Verify Group Who Owns shadow File": "shadow file is not group-owned by root, allowing unauthorized group-level access.",
    "Verify User Who Owns Backup group File": "Backup group file is not owned by root, risking unauthorized alterations.",
    "Verify User Who Owns Backup gshadow File": "Backup gshadow file is not owned by root, weakening protection of group password entries.",
    "Verify User Who Owns Backup passwd File": "Backup passwd file is not owned by root, allowing non-root user modifications.",
    "Verify Group Who Owns Backup shadow File": "Backup shadow file is not group-owned by root, risking exposure of password hashes.",
    "Verify User Who Owns group File": "group file is not owned by root, enabling non-root users to change group memberships.",
    "Verify User Who Owns gshadow File": "gshadow file is not owned by root, potentially exposing or altering group secrets.",
    "Verify User Who Owns passwd File": "The passwd file is not owned by root, risking unauthorized user account modifications.",
    "Verify User Who Owns shadow File": "The shadow file is not owned by root, compromising password hash confidentiality.",
    "Verify Permissions on Backup group File": "Backup group file has overly permissive permissions, allowing unauthorized group changes.",
    "Verify Permissions on Backup gshadow File": "Backup gshadow file is too permissive, risking exposure of group passwords.",
    "Verify Permissions on Backup passwd File": "Backup passwd file permissions are insecure, allowing unauthorized changes.",
    "Verify Permissions on Backup shadow File": "Backup shadow file has weak permissions, exposing sensitive password hashes.",
    "Verify Permissions on group File": "group file permissions are too open, allowing unauthorized group configuration changes.",
    "Verify Permissions on gshadow File": "gshadow file is not securely permissioned, compromising group password confidentiality.",
    "Verify Permissions on passwd File": "passwd file has improper permissions, risking modification of system accounts.",
    "Verify Permissions on shadow File": "shadow file is world-readable or group-writable, exposing password hashes to unauthorized users.",
    "Ensure No World-Writable Files Exist": "World-writable files exist, allowing any user to alter critical files or execute arbitrary code.",
    "Ensure All Files Are Owned by a Group": "Unowned files found without a valid group, which can lead to unauthorized access or misuse.",
    "Ensure All Files Are Owned by a User": "Files without a valid owner exist, making it unclear who has accountability or control.",
    "Verify permissions of log files": "Log files have overly permissive permissions, enabling tampering or deletion by unauthorized users.",
    "Disable the Automounter": "Automounter service is enabled, allowing automatic mounting of potentially untrusted file systems.",
    "Disable Mounting of cramfs": "cramfs is enabled, allowing attackers to mount legacy or malicious read-only file systems.",
    "Disable Modprobe Loading of USB Storage Driver": "USB storage module is loaded, increasing risk of data exfiltration via removable devices.",
    "Add nodev Option to /dev/shm": "/dev/shm is mounted without nodev, allowing device files on shared memory which may be exploited.",
    "Add noexec Option to /dev/shm": "/dev/shm is mounted without noexec, enabling execution of potentially malicious scripts.",
    "Add nosuid Option to /dev/shm": "/dev/shm allows SUID binaries, increasing privilege escalation risks.",
    "Add nodev Option to /home": "/home lacks nodev, which may allow creation of device files by users.",
    "Add nosuid Option to /home": "/home allows SUID binaries, permitting privilege escalation by regular users.",
    "Add nodev Option to /tmp": "/tmp is mounted without nodev, permitting creation of device files by unprivileged users.",
    "Add noexec Option to /tmp": "/tmp allows execution of files, increasing the risk of script-based attacks.",
    "Add nosuid Option to /tmp": "/tmp allows SUID binaries, enabling privilege escalation from user space.",
    "Add nodev Option to /var/log/audit": "/var/log/audit allows device files, posing a security risk for audit logs.",
    "Add noexec Option to /var/log/audit": "/var/log/audit allows execution, risking log tampering via scripts.",
    "Add nosuid Option to /var/log/audit": "/var/log/audit allows SUID binaries, which may be exploited to escalate privileges.",
    "Add nodev Option to /var/log": "/var/log permits device files, creating a risk of unauthorized device interaction.",
    "Add noexec Option to /var/log": "/var/log allows execution of files, allowing malicious scripts to run in log directories.",
    "Add nosuid Option to /var/log": "/var/log allows SUID binaries, which could enable privilege escalation via logging mechanisms.",
    "Add nodev Option to /var": "/var is mounted without nodev, allowing creation of device files by non-root users.",
    "Add nosuid Option to /var": "/var allows SUID binaries, potentially granting unauthorized privilege escalation.",
    "Add nodev Option to /var/tmp": "/var/tmp permits device files, increasing risk of unauthorized device usage.",
    "Add noexec Option to /var/tmp": "/var/tmp allows script execution, facilitating malware persistence.",
    "Add nosuid Option to /var/tmp": "/var/tmp allows SUID binaries, which may enable privilege escalation.",
    "Disable Core Dumps for All Users": "Core dumps are enabled for users, potentially exposing sensitive memory contents.",
    "Disable Core Dumps for SUID programs": "SUID programs can generate core dumps, revealing privileged process memory to attackers.",
    "Enable Randomized Layout of Virtual Address Space": "Address space layout randomization is disabled, making the system more vulnerable to memory corruption exploits.",
    "Disable Apport Service": "Apport is enabled, allowing detailed crash reports which could disclose sensitive process information.",
    "Uninstall avahi Server Package": "Avahi is installed, exposing the system to local network service advertisements and potential MITM attacks.",
    "Disable Avahi Server Software": "Avahi service is enabled, allowing the system to broadcast services on the local network.",
    "Ensure that /etc/at.deny does not exist": "/etc/at.deny exists, allowing denial of at jobs via an insecure file.",
    "Ensure that /etc/cron.deny does not exist": "/etc/cron.deny exists, which can bypass centralized cron access control.",
    "Verify Group Who Owns /etc/at.allow file": "/etc/at.allow is not group-owned by root, allowing unauthorized group modification.",
    "Verify Group Who Owns /etc/cron.allow file": "/etc/cron.allow is not group-owned by root, risking alteration by untrusted groups.",
    "Verify User Who Owns /etc/at.allow file": "/etc/at.allow is not owned by root, permitting untrusted users to modify at access.",
    "Verify User Who Owns /etc/cron.allow file": "/etc/cron.allow is not owned by root, enabling unauthorized control of cron access.",
    "Verify Permissions on /etc/at.allow file": "Permissions on /etc/at.allow are too permissive, allowing access or modifications by unauthorized users.",
    "Verify Permissions on /etc/cron.allow file": "Permissions on /etc/cron.allow are too open, potentially allowing misuse of scheduled task access control.",
    "Enable cron Service": "The cron service is disabled, preventing scheduled jobs from running securely.",
    "Verify Group Who Owns cron.d": "The group ownership of /etc/cron.d is incorrect, allowing unauthorized access to scheduled job definitions.",
    "Verify Group Who Owns cron.daily": "The group ownership of /etc/cron.daily is not root, risking modification by unauthorized users.",
    "Verify Group Who Owns cron.hourly": "Group ownership of /etc/cron.hourly is incorrect, allowing potential tampering of hourly cron jobs.",
    "Verify Group Who Owns cron.monthly": "Group ownership of /etc/cron.monthly is not secure, possibly allowing unauthorized access.",
    "Verify Group Who Owns cron.weekly": "Group ownership of /etc/cron.weekly is misconfigured, risking security of weekly scheduled tasks.",
    "Verify Group Who Owns Crontab": "The group ownership of /etc/crontab is not root, risking unauthorized changes to global cron settings.",
    "Verify Owner on cron.d": "Owner of /etc/cron.d is not root, allowing unauthorized creation or modification of cron jobs.",
    "Verify Owner on cron.daily": "Owner of /etc/cron.daily is not root, enabling untrusted users to modify daily scheduled tasks.",
    "Verify Owner on cron.hourly": "The owner of /etc/cron.hourly is not root, risking privilege escalation via scheduled scripts.",
    "Verify Owner on cron.monthly": "The /etc/cron.monthly directory is not owned by root, allowing unauthorized changes.",
    "Verify Owner on cron.weekly": "Weekly cron directory is not owned by root, allowing potential tampering of scripts.",
    "Verify Owner on crontab": "The crontab file is not owned by root, compromising the integrity of scheduled jobs.",
    "Verify Permissions on cron.d": "Permissions on /etc/cron.d are too open, enabling unauthorized users to view or modify scheduled jobs.",
    "Verify Permissions on cron.daily": "Permissions on /etc/cron.daily are insecure, allowing unauthorized modification.",
    "Verify Permissions on cron.hourly": "The /etc/cron.hourly directory is too permissive, risking integrity of hourly jobs.",
    "Verify Permissions on cron.monthly": "The /etc/cron.monthly directory has excessive permissions, allowing tampering of monthly jobs.",
    "Verify Permissions on cron.weekly": "Permissions on /etc/cron.weekly are overly permissive, compromising weekly job security.",
    "Verify Permissions on crontab": "The crontab file has improper permissions, allowing unauthorized edits.",
    "Uninstall the nis package": "NIS is installed, exposing the system to legacy and insecure network information services.",
    "Uninstall DHCP Server Package": "DHCP server package is installed, which may allow unauthorized IP address distribution.",
    "Uninstall bind Package": "BIND is installed, which may allow the system to act as a DNS server, increasing attack surface.",
    "Uninstall vsftpd Package": "vsftpd is installed, exposing the system to potential FTP-related vulnerabilities.",
    "Uninstall apache2 Package": "Apache2 is installed, increasing the system’s attack surface via exposed web services.",
    "Uninstall nginx Package": "Nginx is installed and may be unintentionally exposing HTTP services to the network.",
    "Uninstall cyrus-imapd Package": "Cyrus IMAP server is installed, increasing risk if unused or misconfigured.",
    "Uninstall dovecot Package": "Dovecot IMAP server is installed, adding unnecessary mail service exposure.",
    "Ensure LDAP client is not installed": "LDAP client software is present, which may connect to untrusted directory services.",
    "Uninstall openldap-servers Package": "OpenLDAP server is installed, exposing the system as a directory service server.",
    "Disable Postfix Network Listening": "Postfix is configured to listen on external interfaces, potentially exposing mail services to unauthorized access.",
    "Ensure Mail Transfer Agent is not Listening on any non-loopback Address": "MTA is listening on non-loopback interfaces, increasing exposure to mail-based attacks.",
    "Uninstall rpcbind Package": "rpcbind is installed, enabling remote procedure calls which may be exploited over the network.",
    "Uninstall nfs-kernel-server Package": "NFS server is installed, potentially exposing file systems over the network.",
    "Install the systemd_timesyncd Service": "The systemd-timesyncd service is not installed, preventing proper time synchronization.",
    "The Chronyd service is enabled": "Chronyd service is disabled, preventing reliable time synchronization.",
    "Enable the NTP Daemon": "The NTP daemon is disabled, risking inaccurate system time and failed authentication mechanisms.",
    "Enable systemd_timesyncd Service": "systemd-timesyncd is not enabled, resulting in lack of automatic time synchronization.",
    "Ensure that chronyd is running under chrony user account": "Chronyd is not configured to run as the chrony user, violating least privilege principles.",
    "Configure server restrictions for ntpd": "NTPD server restrictions are not defined, allowing unrestricted access to time synchronization services.",
    "Configure ntpd To Run As ntp User": "ntpd is not running under a dedicated ntp user, violating principle of least privilege.",
    "Uninstall rsh Package": "rsh is installed, providing insecure remote shell access without encryption.",
    "Remove Rsh Trust Files": "Rsh trust files are present, allowing passwordless login via rsh, which is insecure.",
    "Uninstall talk Package": "talk is installed, allowing unencrypted messaging which can be intercepted.",
    "Remove telnet Clients": "Telnet clients are installed, allowing plaintext remote sessions vulnerable to interception.",
    "Uninstall rsync Package": "rsync is installed but unused, posing a potential security risk if misconfigured or exploited.",
    "Uninstall CUPS Package": "CUPS is installed, exposing the system to network printing vulnerabilities.",
    "Disable the CUPS Service": "CUPS service is running, exposing local or network printing features that may be vulnerable.",
    "Uninstall squid Package": "Squid proxy server is installed and may allow unintended traffic forwarding.",
    "Uninstall Samba Package": "Samba is installed, exposing file shares to the network which may be vulnerable or misconfigured.",
    "Uninstall net-snmp Package": "net-snmp is installed, exposing the system to SNMP protocol vulnerabilities if not secured.",
    "Set SSH Client Alive Count Max": "The SSH client alive count max is not configured or is set too high, allowing idle sessions to persist too long.",
    "Set SSH Client Alive Interval": "The SSH client alive interval is not set, risking unresponsive SSH sessions from being kept open indefinitely.",
    "Disable Host-Based Authentication": "Host-based authentication is enabled, allowing access based on host trust instead of user authentication.",
    "Disable SSH Access via Empty Passwords": "SSH is configured to allow logins with empty passwords, risking unauthorized access.",
    "Disable SSH Support for .rhosts Files": "SSH is configured to respect .rhosts files, which are insecure and outdated.",
    "Disable SSH Root Login": "Root login via SSH is enabled, allowing direct access to the root account and increasing the risk of brute-force attacks.",
    "Do Not Allow SSH Environment Options": "SSH is configured to accept environment variables, which can be exploited for privilege escalation.",
    "Enable PAM": "PAM is not enabled in SSH, reducing access control flexibility and weakening authentication mechanisms.",
    "Enable SSH Warning Banner": "No SSH warning banner is configured, missing legal notices and deterrents for unauthorized access.",
    "Limit Users' SSH Access": "SSH user access is not limited, allowing all users to access the system via SSH unnecessarily.",
    "Ensure SSH LoginGraceTime is configured": "SSH LoginGraceTime is not set or is too long, allowing extended time for unauthorized login attempts.",
    "Set LogLevel to INFO": "SSH LogLevel is not set to INFO, reducing the amount of useful audit information in logs.",
    "Set SSH authentication attempt limit": "The maximum number of SSH authentication attempts is not limited, allowing brute-force attacks.",
    "Set SSH MaxSessions limit": "MaxSessions is not limited in SSH, allowing users to open too many simultaneous sessions.",
    "Ensure SSH MaxStartups is configured": "SSH MaxStartups is not properly configured, potentially allowing denial-of-service attacks.",
    "Use Only Strong Ciphers": "Weak or deprecated SSH ciphers are allowed, weakening the cryptographic strength of SSH sessions.",
    "Use Only Strong Key Exchange algorithms": "Insecure SSH key exchange algorithms are allowed, making the session vulnerable to interception.",
    "Use Only Strong MACs": "Insecure SSH MACs are allowed, risking integrity and authenticity of SSH communications.",
    "Verify Group Who Owns SSH Server config file": "The SSH config file (/etc/ssh/sshd_config) group ownership is incorrect, allowing unauthorized access.",
    "Verify Owner on SSH Server config file": "The SSH config file (/etc/ssh/sshd_config) is not owned by root, risking unauthorized modifications.",
    "Verify Permissions on SSH Server config file": "Permissions on /etc/ssh/sshd_config are too permissive, allowing unauthorized read or write access.",
    "Verify Permissions on SSH Server Private *_key Key Files": "SSH private key files have improper permissions, risking key exposure.",
    "Verify Permissions on SSH Server Public *.pub Key Files": "SSH public key files have overly permissive permissions, potentially exposing sensitive information.",
    "Remove the X Windows Package Group": "X Windows is installed on a server system, increasing the attack surface with unnecessary GUI components.",
    "System Audit Logs Must Have Mode 0750 or Less Permissive": "Audit logs are accessible to unauthorized users due to overly permissive file modes.",
    "System Audit Logs Must Be Group Owned By Root": "Audit logs are not group-owned by root, allowing non-root users to manipulate or read them.",
    "Audit Configuration Files Must Be Owned By Group root": "Audit configuration files are not group-owned by root, risking unauthorized changes.",
    "Audit Configuration Files Must Be Owned By Root": "Audit configuration files are not owned by root, allowing unauthorized edits.",
    "System Audit Logs Must Be Owned By Root": "Audit logs are not owned by root, reducing log integrity and security.",
    "System Audit Logs Must Have Mode 0640 or Less Permissive": "Audit log files have permissions that are too open, allowing unauthorized access.",
    "Verify that audit tools are owned by group root": "Audit tools are not group-owned by root, potentially allowing manipulation by non-privileged users.",
    "Verify that audit tools are owned by root": "Audit tool binaries are not owned by root, allowing tampering by unauthorized users.",
    "Verify that audit tools Have Mode 0755 or less": "Audit tools have overly permissive modes, risking modification or misuse.",
    "Verify Permissions on /etc/audit/auditd.conf": "Permissions on auditd.conf are too open, risking unauthorized access to audit settings.",
    "Verify Permissions on /etc/audit/rules.d/*.rules": "Permissions on audit rules files are too permissive, risking unauthorized changes to audit policy."
}


